/**
 * `             1234.568`一共占20个字符（小数点也算一位），四舍五入，精确到3位小数
 *
 * 浮点数转整型，是直接截断，不是四舍五入。
 * 
 * 默认右对齐，%-7d左对齐。
 */

#include <stdio.h>
int main()
{
    double num = 1234.5678;
    printf("%20.3lf\n", num);       // 右对齐，四舍五入
    printf("%20.3lf\n", -num);       // 负数的四舍五入一样
    printf("%3.2lf\n", num);        // 如果整数部分超出，则按整数部分都输出
    printf("%-1.10e\n", num);        // 左对齐，指数形式输出，

    double a = 1.4, b = 1.5, c = 1.5, d = -1.5;
    printf("%d %d %d %d\n", (int)a, (int)b, (int)c, (int)d);

    return 0;
}
/**
            1234.568
1234.57
1.2345678000e+003
1 1 1 -1
*/
